ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/clkman_regs.h
/**
 * @file
 * @brief   Type definitions for the Clock Management Interface
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-08-15 11:08:12 -0500 (Mon, 15 Aug 2016) $
 * $Revision: 24058 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_CLKMAN_REGS_H_
#define _MXC_CLKMAN_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __RO
#define __RO volatile const
#endif
/// @endcond

/**
 * @ingroup     clkman
 * @defgroup    clkman_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */

/**
 * Structure type for the Clock Management module registers allowing direct 32-bit access to each register.
 */
typedef struct {
    __IO uint32_t clk_config;                           /**< <tt>\b 0x0000:       </tt> CLKMAN_CLK_CONFIG Register - System Clock Configuration                   */
    __IO uint32_t clk_ctrl;                             /**< <tt>\b 0x0004:       </tt> CLKMAN_CLK_CTRL Register - System Clock Controls                          */
    __IO uint32_t intfl;                                /**< <tt>\b 0x0008:       </tt> CLKMAN_INTFL Register - Interrupt Flags                                   */
    __IO uint32_t inten;                                /**< <tt>\b 0x000C:       </tt> CLKMAN_INTEN Register - Interrupt Enable/Disable Controls                 */
    __IO uint32_t trim_calc;                            /**< <tt>\b 0x0010:       </tt> CLKMAN_TRIM_CALC Register - Trim Calculation Controls                     */
    __IO uint32_t i2c_timer_ctrl;                       /**< <tt>\b 0x0014:       </tt> CLKMAN_I2C_TIMER_CTRL Register - I2C Timer Control                        */
    __IO uint32_t cm4_start_clk_en0;                    /**< <tt>\b 0x0018:       </tt> CLKMAN_CM4_START_CLK_EN0 Register - CM4 Start Clock on Interrupt Enable 0 */
    __IO uint32_t cm4_start_clk_en1;                    /**< <tt>\b 0x001C:       </tt> CLKMAN_CM4_START_CLK_EN1 Register - CM4 Start Clock on Interrupt Enable 1 */
    __IO uint32_t cm4_start_clk_en2;                    /**< <tt>\b 0x0020:       </tt> CLKMAN_CM4_START_CLK_EN2 Register - CM4 Start Clock on Interrupt Enable 2 */
    __RO uint32_t rsv024[7];                            /**< <tt>\b 0x0024-0x003C:</tt> RESERVED                                                                  */
    __IO uint32_t sys_clk_ctrl_0_cm4;                   /**< <tt>\b 0x0040:       </tt> CLKMAN_SYS_CLK_CTRL_0_CM4 Register - Cortex M4 Clock                      */
    __IO uint32_t sys_clk_ctrl_1_sync;                  /**< <tt>\b 0x0044:       </tt> CLKMAN_SYS_CLK_CTRL_1_SYNC Register - Synchronizer Clock                  */
    __IO uint32_t sys_clk_ctrl_2_spix;                  /**< <tt>\b 0x0048:       </tt> CLKMAN_SYS_CLK_CTRL_2_SPIX Register - SPI XIP Clock                       */
    __IO uint32_t sys_clk_ctrl_3_prng;                  /**< <tt>\b 0x004C:       </tt> CLKMAN_SYS_CLK_CTRL_3_PRNG Register - PRNG Clock                          */
    __IO uint32_t sys_clk_ctrl_4_wdt0;                  /**< <tt>\b 0x0050:       </tt> CLKMAN_SYS_CLK_CTRL_4_WDT0 Register -  Watchdog Timer 0                   */
    __IO uint32_t sys_clk_ctrl_5_wdt1;                  /**< <tt>\b 0x0054:       </tt> CLKMAN_SYS_CLK_CTRL_5_WDT1 Register - Watchdog Timer 1                    */
    __IO uint32_t sys_clk_ctrl_6_gpio;                  /**< <tt>\b 0x0058:       </tt> CLKMAN_SYS_CLK_CTRL_6_GPIO Register - Clock for GPIO Ports                */
    __IO uint32_t sys_clk_ctrl_7_pt;                    /**< <tt>\b 0x005C:       </tt> CLKMAN_SYS_CLK_CTRL_7_PT Register - Source Clock for All Pulse Trains     */
    __IO uint32_t sys_clk_ctrl_8_uart;                  /**< <tt>\b 0x0060:       </tt> CLKMAN_SYS_CLK_CTRL_8_UART Register - Source Clock for All UARTs          */
    __IO uint32_t sys_clk_ctrl_9_i2cm;                  /**< <tt>\b 0x0064:       </tt> CLKMAN_SYS_CLK_CTRL_9_I2CM Register  - Source Clock for All I2C Masters   */
    __IO uint32_t sys_clk_ctrl_10_i2cs;                 /**< <tt>\b 0x0068:       </tt> CLKMAN_SYS_CLK_CTRL_10_I2CS Register - Source Clock for I2C Slave         */
    __IO uint32_t sys_clk_ctrl_11_spi0;                 /**< <tt>\b 0x006C:       </tt> CLKMAN_SYS_CLK_CTRL_11_SPI0 Register - SPI Master 0                       */
    __IO uint32_t sys_clk_ctrl_12_spi1;                 /**< <tt>\b 0x0070:       </tt> CLKMAN_SYS_CLK_CTRL_12_SPI1 Register - SPI Master 1                       */
    __IO uint32_t sys_clk_ctrl_13_spi2;                 /**< <tt>\b 0x0074:       </tt> CLKMAN_SYS_CLK_CTRL_13_SPI2 Register - SPI Master 2                       */
    __IO uint32_t sys_clk_ctrl_14_spib;                 /**< <tt>\b 0x0078:       </tt> CLKMAN_SYS_CLK_CTRL_14_SPIB Register - SPI Bridge Clock                   */
    __IO uint32_t sys_clk_ctrl_15_owm;                  /**< <tt>\b 0x007C:       </tt> CLKMAN_SYS_CLK_CTRL_15_OWM Register  - 1-Wire Master Clock                */
    __IO uint32_t sys_clk_ctrl_16_spis;                 /**< <tt>\b 0x0080:       </tt> CLKMAN_SYS_CLK_CTRL_16_SPIS Register - SPI Slave Clock                    */
    __RO uint32_t rsv084[31];                           /**< <tt>\b 0x0084-0x00FC:</tt> RESERVED:                                                                 */
    __IO uint32_t crypt_clk_ctrl_0_aes;                 /**< <tt>\b 0x0100:       </tt> CLKMAN_CRYPT_CLK_CTRL_0_AES Register - AES                                */
    __IO uint32_t crypt_clk_ctrl_1_maa;                 /**< <tt>\b 0x0104:       </tt> CLKMAN_CRYPT_CLK_CTRL_1_MAA Register - MAA                                */
    __IO uint32_t crypt_clk_ctrl_2_prng;                /**< <tt>\b 0x0108:       </tt> CLKMAN_CRYPT_CLK_CTRL_2_PRNG Register - PRNG                              */
    __RO uint32_t rsv10C[13];                           /**< <tt>\b 0x010C-0x013C:</tt> RESERVED                                                                  */
    __IO uint32_t clk_gate_ctrl0;                       /**< <tt>\b 0x0140:       </tt> CLKMAN_CLK_GATE_CTRL0 Register - Dynamic Clock Gating Control Register 0  */
    __IO uint32_t clk_gate_ctrl1;                       /**< <tt>\b 0x0144:       </tt> CLKMAN_CLK_GATE_CTRL1 Register - Dynamic Clock Gating Control Register 1  */
    __IO uint32_t clk_gate_ctrl2;                       /**< <tt>\b 0x0148:       </tt> CLKMAN_CLK_GATE_CTRL2 Register - Dynamic Clock Gating Control Register 2  */
} mxc_clkman_regs_t;
/**@} end of clkman_registers */

